[
    {
        "about": "Après trois années de prépa commerce, j'ai décidé de me réorienter. Plus jeune je me suis intéressé à deux langages du développement front-end, à savoir HTML et CSS. Cela m'a inspiré dans ma reconversion et je me suis ainsi lancé dans l'univers du développement front-end. J'ai pu apprendre les règles élémentaires concernant le langage html, l'utilisation de css et comment allier programmation et styling grâce à SASS. J'ai enfin découvert des outils comme Node.js, Redux, MongoDB et bien évidemment le framework React qui sont des indispensables dans cet environnement là. Je suis ravi d'arriver à la fin de cette formation, je sais que l'apprentissage ne fait que commencer et j'espère pouvoir acquérir de l'expérience sans plus attendre."
    },
    {
        "logos": ["/images/css.png", "/images/git.png", "/images/github.png", "/images/html5.png", "/images/js.png", "/images/mongo.png", "/images/nodejs.png", "/images/postman.png", "/images/react.png", "/images/redux.png", "/images/sass.png", "/images/tailwind.png"]
    },
    {
        "projects": [
            {
                "name": "Kasa",
                "keyWord": "React",
                "description": "Le projet Kasa a été ma première initiation à React. J'ai pu découvrir l'utilisation du framework et des composants. Le site Kasa permet à l'utilisateur de découvrir des biens immobiliers.",
                "githubUrl": "https://github.com/MaxinC0de/KASA",
                "websiteUrl": "https://vercel.com/maxinc0des-projects/kasa/7TFCR1M9qFPYwpJQQWkZc9toKzHn",
                "stack": ["/images/css.png", "/images/js.png", "/images/nodejs.png", "/images/react.png", "/images/sass.png", "/images/html.png"]
            },
            {
                "name": "Argent Bank",
                "keyWord": "Redux",
                "description": "Grâce au projet Argent Bank j'ai découvert Redux ainsi que la gestion des opérations asynchrones grâce à Axios et auxaux Thunks. J'ai également manipulé Swagger pour l'écriture des Endpoints d'une API.",
                "githubUrl": "https://github.com/MaxinC0de/P10",
                "websiteUrl": "https://p10-nu.vercel.app/",
                "stack": ["/images/css.png", "/images/js.png", "/images/react.png", "/images/redux.png", "/images/github.png", "/images/mongo.png"]
            }
        ]
    }
]